# Loading data

In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D

In [10]:
data = pd.read_csv("turboaz.csv")[["Buraxilish ili", "Yurush", "Qiymet"]]
data.head() #showing few rows

   Buraxilish ili      Yurush     Qiymet
0            1999  366 000 km  12500 AZN
1            2014  102 000 km    31500 $
2            2002  469 700 km  11700 AZN
3            1998  556 680 km   9700 AZN
4            2000  300 000 km  12700 AZN

In [11]:
print(data['Qiymet'].unique())

['12500 AZN' '31500 $' '11700 AZN' '9700 AZN' '12700 AZN' '11200 AZN'
 '13800 AZN' '11400 AZN' '8500 AZN' '6800 AZN' '11300 AZN' '9300 AZN'
 '12800 AZN' '7300 AZN' '12400 AZN' '7350 AZN' '10500 AZN' '12300 AZN'
 '10900 AZN' '14000 AZN' '10700 AZN' '7500 AZN' '8300 AZN' '8600 AZN'
 '12650 AZN' '11800 AZN' '12000 AZN' '11900 AZN' '32700 $' '50999 $'
 '9500 AZN' '11000 AZN' '9000 AZN' '10400 AZN' '11600 AZN' '10850 AZN'
 '36500 $' '10800 AZN' '10750 AZN' '9900 AZN' '10000 AZN' '6900 AZN'
 '18500 AZN' '8700 AZN' '11500 AZN' '8200 AZN' '7800 AZN' '8900 AZN'
 '10300 AZN' '8400 AZN' '7900 AZN' '10600 AZN' '56500 $' '15400 AZN'
 '12900 AZN' '37000 $' '18400 $' '9100 AZN' '9800 AZN' '55000 $'
 '10200 AZN' '10950 AZN' '16800 AZN' '14300 AZN' '13000 AZN' '20800 $'
 '12200 AZN' '15000 AZN' '8000 AZN' '15300 AZN' '15800 $' '4500 AZN'
 '19800 $' '13300 AZN' '7700 AZN' '29000 $' '13900 AZN' '9200 AZN'
 '7000 AZN' '12600 AZN' '8800 AZN' '6000 AZN' '13100 AZN' '13500 AZN'
 '14200 AZN' '10450 AZN' '16500 AZN' '11100 AZN' '14900 AZN' '13252 AZN'
 '46000 $' '8100 AZN' '14500 AZN' '11450 AZN' '5800 AZN' '33900 $'
 '6500 $' '31500 AZN' '13400 AZN' '6500 AZN' '10999 AZN' '11399 AZN'
 '17000 $' '14800 AZN' '28800 AZN' '15500 AZN' '15600 AZN' '9600 AZN'
 '21900 $' '11850 AZN' '12100 AZN' '16600 AZN' '7200 AZN' '13375 AZN'
 '17500 $' '12550 AZN' '29900 AZN' '12850 AZN' '16000 AZN' '21500 AZN'
 '19000 $' '1130 AZN' '8550 AZN' '18900 $' '4300 AZN' '5900 $' '9250 AZN'
 '13700 AZN' '53500 $' '6600 AZN' '20500 $' '9999 AZN' '6300 AZN'
 '7450 AZN' '7400 AZN' '13600 AZN' '22500 $' '6700 AZN' '34900 $'
 '12250 AZN' '24900 $' '19800 AZN' '7600 AZN' '27500 AZN' '10100 AZN'
 '25500 AZN' '15500 $' '11250 AZN' '6400 AZN' '13750 AZN' '8250 AZN'
 '13333 AZN' '20400 $' '22000 AZN' '31000 AZN' '16500 $' '11950 AZN'
 '49500 $' '19600 $' '19700 $' '18700 $' '10650 AZN' '38000 $' '5400 AZN'
 '9350 AZN' '19600 AZN' '35500 $' '13200 AZN' '99500 AZN' '23800 AZN'
 '37500 $' '26500 AZN' '8150 AZN' '12577 AZN' '14050 AZN']

In [12]:
# defining convert(string to int) function for column 'Yurush'
def yurush_string_to_int(data):
    data['Yurush'] = data['Yurush'].str.replace(' km', '').str.replace(' ', '').astype(int)

In [13]:
yurush_string_to_int(data) #calling the convert function
data.head() #displaying

   Buraxilish ili  Yurush     Qiymet
0            1999  366000  12500 AZN
1            2014  102000    31500 $
2            2002  469700  11700 AZN
3            1998  556680   9700 AZN
4            2000  300000  12700 AZN

In [14]:
def qiymet_dollar_to_azn(data):
    converted_qiymet = [float(price.replace('$', '').strip()) * 1.7 if '$' in price else float(price.replace(' AZN', '').strip()) for price in data['Qiymet']]
    data['Qiymet'] = converted_qiymet

In [15]:
qiymet_dollar_to_azn(data)
data.head()

   Buraxilish ili  Yurush   Qiymet
0            1999  366000  12500.0
1            2014  102000  53550.0
2            2002  469700  11700.0
3            1998  556680   9700.0
4            2000  300000  12700.0

# Visualization